package ru.wilyfox.utils;

public final class BossName {

    private BossName() {}

    public static String getBossName(String text) {
        switch (text) {
            // Overworld
            case "КРИГЕР" -> {
                return  "Кригер";
            }
            case "СЛИЗЕНЬ" -> {
                return  "Слизень";
            }
            case "КРЫСИНЫИ КОРОЛЬ" -> {
                return  "Крысиный Король";
            }
            case "КОШМАР" -> {
                return  "Кошмар";
            }
            case "ВЕНДИГО" -> {
                return  "Вендиго";
            }
            case "УЛЬДРИК" -> {
                return  "Ульдрик";
            }
            case "ПАУЧИХА" -> {
                return  "Паучиха";
            }
            case "МЕРЛОК" -> {
                return  "Мерлок";
            }
            case "ЭЛЕМЕНТАЛИСТ" -> {
                return  "Элементалист";
            }
            case "ЖНЕЦ" -> {
                return  "Жнец";
            }
            case "НАЕЗДНИК" -> {
                return  "Наездник";
            }
            case "РАЗБОИНИК" -> {
                return  "Разбойник";
            }
            case "ШАМАН" -> {
                return  "Шаман";
            }
            case "ВАРДЕН" -> {
                return  "Варден";
            }
            case "КОРОЛЕВСКАЯ ЖАБА" -> {
                return  "Королевская Жаба";
            }
            case "ГИГАНТ" -> {
                return  "Гигант";
            }
            case "БЕССМЕРТНЫИ ЛЕГИОН" -> {
                return  "Бессмертный Легион";
            }
            case "БЕЗУМНЫИ АЛХИМИК" -> {
                return  "Безумный Алхимик";
            }
            case "НЕКРОМАНТ" -> {
                return  "Некромант";
            }
            case "ПОЖИРАТЕЛЬ ТЬМЫ" -> {
                return  "Пожиратель Тьмы";
            }
            case "ЧУДОВИЩЕ" -> {
                return  "Чудовище";
            }
            case "ОКТОПУС" -> {
                return  "Октопус";
            }
            case "КУЗНЕЦ" -> {
                return  "Кузнец";
            }
            case "ПОВЕЛИТЕЛЬ ГРОМА" -> {
                return  "Повелитель Грома";
            }
            case "ГАРГУЛЬЯ" -> {
                return  "Гаргулья";
            }
            case "ВСАДНИК" -> {
                return  "Всадник";
            }
            case "КОБОЛЬД" -> {
                return  "Кобольд";
            }
            case "САМУРАИ" -> {
                return  "Самурай";
            }
            case "ПОВЕЛИТЕЛЬ МЕРТВЫХ" -> {
                return  "Повелитель Мёртвых";
            }
            case "РЫЦАРЬ СВЕТА" -> {
                return  "Рыцарь Света";
            }
            case "ГИГАНТСКАЯ ЧЕРЕПАХА" -> {
                return  "Гигантская черепаха";
            }
            case "ЗМЕИНАЯ ЖРИЦА" -> {
                return  "Змеиная Жрица";
            }
            case "МОГУЩЕСТВЕННЫИ ШАЛКЕР" -> {
                return  "Могущественный Шалкер";
            }
            case "СНЕЖНЫИ МОНСТР" -> {
                return  "Снежный Монстр";
            }
            case "ДУХ ЛЕСА" -> {
                return  "Дух Леса";
            }
            case "СПЕКТРАЛЬНЫИ КУБ" -> {
                return  "Спектральный Куб";
            }
            case "ЦИКЛОП" -> {
                return  "Циклоп";
            }
            case "ГИДРА" -> {
                return  "Гидра";
            }
            case "МАГНУС" -> {
                return  "Магнус";
            }
            case "ВЕСТНИЦА АДА" -> {
                return  "Вестница Ада";
            }

            // Nether
            case "ЦЕРБЕР" -> {
                return  "Цербер";
            }
            case "КОРОЛЬ ИФРИТОВ" -> {
                return  "Король Ифритов";
            }
            case "БАФОМЕТ" -> {
                return  "Бафомет";
            }
            case "ЛАВОВЫИ МОНСТР" -> {
                return  "Лавовый Монстр";
            }
            case "КОРОЛЕВА ПИГЛИНОВ" -> {
                return  "Королева Пиглинов";
            }
            case "ДРАКАИНА" -> {
                return  "Дракайна";
            }
            case "ВЕРХОВНЫИ БЕС" -> {
                return  "Верховный Бес";
            }
            case "БРУТАЛЬНЫИ ПИГЛИН" -> {
                return  "Брутальный Пиглин";
            }
            case "АДСКИИ СЛИЗЕНЬ" -> {
                return  "Адский Слизень";
            }
            case "ЗОГЛИН" -> {
                return  "Зоглин";
            }
            case "ДЕМОНИЧЕСКИИ РЫЦАРЬ" -> {
                return  "Демонический Рыцарь";
            }

            // END
            case "СИНТИЯ" -> {
                return  "Синтия";
            }
            case "РЫЦАРЬ ЭНДА" -> {
                return  "Рыцарь Энда";
            }
            case "МАГ ПРОСТРАНСТВА" -> {
                return  "Маг Пространства";
            }
            case "ШАЛКЕРОВЫИ СТРАЖ" -> {
                return  "Шалкеровый Страж";
            }
            case "ЭНДЕР ГОЛЕМ" -> {
                return  "Эндер Голем";
            }
            case "КОРОЛЕВА ТЕНЕИ" -> {
                return  "Королева Теней";
            }
            case "ХРАНИТЕЛЬ" -> {
                return  "Хранитель";
            }
            case "ВОИД" -> {
                return  "Воид";
            }
            case "СТРАННИК ИЗМЕРЕНИИ" -> {
                return  "Странник Измерений";
            }
            default -> {
                return null;
            }
        }
    }
}
